# Домашнее задание к занятию 4.2. Коллекции. Очередь.
## Задача. Лифт
#### Описание
Сегодня мы будем реализовывать программу для работы лифта 25-и этажного дома. Нужно написать программу, которая считывает данные из консоли, ожидая ввода номера этажа. После ввода каждого числа (номера этажа) добавляет значение в очередь дальнейшего перемещения лифта. Как только пользователь введет 0, программа должна последовательно вывести список всех этажей, на которых лифт делал остановки, в формате: "этаж 1 -> этаж 22 -> этаж 0". Если пользователь ввел этаж вне диапазона 0-25, проигнорировать ввод таких данных. Для реализации хранения введенных пользователем этажей отлично подойдет структура на основе интерфейса очередь (queue). По мере ввода мы сможем добавлять в конец очереди новые значения.

#### Функционал программы
- Ввод номеров этажей
- Вывод информации о посещенных этажах в порядке добавления в формате: "`этаж 1 -> этаж 22 -> этаж 0`".
___Пример___
~~~
Ожидаю ввода этажа: (для завершения введите 0)
5 <enter>
Ожидаю ввода этажа: (для завершения введите 0)
12 <enter>
Ожидаю ввода этажа: (для завершения введите 0)
38 <enter>
Такого этажа нет в доме
Ожидаю ввода этажа: (для завершения введите 0)
0 <enter>
Лифт проследовал по следующим этажам:
этаж 5 -> этаж 12 - этаж 0   
~~~
#### Процесс реализации
1. В бесконечном цикле считывать номера этажей до тех пор, пока не будет введен нулевой этаж.
~~~
while (true)   
~~~
2. Перед каждым вводом запросить номер следующего этажа - вывести сообщение "Ожидаю ввода этажа: (для завершения введите 0)", чтобы пользователь понимал, что ему вводить.
~~~
System.out.println("введи номер этожа от 1 до 25 или 0 для выхода");
~~~
3. Добавить проверку: если введенный этаж входит в диапазон допустимых значений 0-25, продолжить работу программы; а если не входит, то вывести на экран сообщение: "Такого этажа нет в доме".
Добавить проверку: если введенный этаж = 0, нужно выйти из цикла "чтение данных из консоли".
~~~
  Integer numberFlor = Integer.parseInt(input);
                    if (numberFlor < 0 || numberFlor > 25) {
                        System.out.println("такого этажа нет");
~~~

4. Если введенный этаж входит в диапазон 0-25, то нужно добавить значение в очередь и запросить ввод данных повторно.
Для вывода информации на экран, используя метод интерфейса Queue, прочитать последовательно все значения и вывести на экран.
~~~
         flor.offer(numberFlor);
~~~                    
